% 耦合材料固定边界热传导方程最简显格式求解器Demo
%
% Gavin <www.bigbugs.cn>

%% 参数设置
rho = [300 862 74.2 1.18]; %材料密度
c = [1377 2100 1726 1005]; %材料比热容
k = [0.082 0.37 0.045 0.028]; %材料热传导系数
height = [0.6 6 3.6 5]*1e-3; %各层材料长度
tao =  0.1; %时间步长(s)
time_span = 60*60; %时间跨度(s)，此处设60min
h = [0.2 1 0.6 2.5]*1e-3; 
%四层材料推荐空间步长(m)，不需让相应层材料长度整除，会在子函数中处理
Tin = 75; %内层稳定热源温度（第一层）
Tout = 37; %外层稳定热源温度（最后一层）
Tinit = 37; %初始温度

%% 主函数调用
[heat, x, t] = CN(rho, c, k, height, tao, time_span, h, Tin, Tout, Tinit);
mesh(x, t, heat)